# ####################################################################

#  Created by Genus(TM) Synthesis Solution 25.11-s095_1 on Tue Jun 23 08:53:00 IST 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design cpu_top_wrapper

create_clock -name "clk" -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_clock_gating_check -setup 0.0 
