###############################################################
#  Generated by:      Cadence Innovus 25.11-s102_1
#  OS:                Linux x86_64(Host ID localhost.localdomain)
#  Generated on:      Tue Jun 23 10:19:48 2026
#  Design:            cpu_top_wrapper
#  Command:           saveDesign cpu_top_wrapper_postroute.enc
###############################################################
current_design cpu_top_wrapper
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}]  -name clk -period 10.000000 -waveform {0.000000 5.000000}
set_propagated_clock  [get_ports {clk}]
#END OF CLOCK SECTION#
